**Estudo pandas parte 2**

**pydataset ( importa alguns datasets de exemplo do formato de dataframe do pandas)**

In [1]:
import pydataset
# mostrando os datadets disponiveis usando o head para nao ficar com a lista toda
pydataset.data().head()

      dataset_id                                        title
0  AirPassengers  Monthly Airline Passenger Numbers 1949-1960
1        BJsales            Sales Data with Leading Indicator
2            BOD                    Biochemical Oxygen Demand
3   Formaldehyde                Determination of Formaldehyde
4   HairEyeColor    Hair and Eye Color of Statistics Students

In [2]:
# carregando um dataset da lista
titanic = pydataset.data("titanic")

# com o comando head e possivel pegar so o comeco de um dataframe
titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [3]:
# assim como na serie e possivel pegar informacoes gerais do dataframe com describe
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [4]:
# contando valores de uma coluna
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64

**Carregando dados de um banco no dataframe do pandas com db.py**

Este cara permite que vc carregue dados do banco diretamente do dataframe do panda (desde que vc tenha o driver correto para tanto e um banco suportado) a titulo de exemplo vou usar o "banco de teste" da ferramenta.

In [6]:
from db import DemoDB # or connect to your own using DB. see below
db = DemoDB() # comes from: http://chinookdatabase.codeplex.com/
db.tables

Indexing schema. This will take a second...finished!
Refreshing schema. Please wait...done!

+--------+---------------+----------------------------------------------------------------------------------+
| Schema | Table         | Columns                                                                          |
+--------+---------------+----------------------------------------------------------------------------------+
| public | Album         | AlbumId, Title, ArtistId                                                         |
| public | Artist        | ArtistId, Name                                                                   |
| public | Customer      | CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalC |
|        |               | ode, Phone, Fax, Email, SupportRepId                                             |
| public | Employee      | EmployeeId, LastName, FirstName, Title, ReportsTo, BirthDate, HireDate, Address, |
|        |               |  City, State, Country, PostalCode, Phone, Fax, Email                             |
| public | Genre         | GenreId, Name                                                                    |
| public | Invoice       | InvoiceId, CustomerId, InvoiceDate, BillingAddress, BillingCity, BillingState, B |
|        |               | illingCountry, BillingPostalCode, Total                                          |
| public | InvoiceLine   | InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity                           |
| public | MediaType     | MediaTypeId, Name                                                                |
| public | Playlist      | PlaylistId, Name                                                                 |
| public | PlaylistTrack | PlaylistId, TrackId                                                              |
| public | Track         | TrackId, Name, AlbumId, MediaTypeId, GenreId, Composer, Milliseconds, Bytes, Uni |
|        |               | tPrice                                                                           |
+--------+---------------+----------------------------------------------------------------------------------+

In [18]:
# recuperando uma tabela como dataframe
customer_df = db.tables.Customer.all()
# mostrando coluna customer name
customer_df['FirstName'].head()

0         Luís
1       Leonie
2     François
3        Bjørn
4    František
Name: FirstName, dtype: object

In [24]:
# recuperendo dados a partir de uma query utilizando templastes

q = """
SELECT
    firstname,lastname
FROM
    {{ name }}
"""
querydata = [
  {"name": "Customer"},
  
]

query_result = db.query(q,data=querydata)
print(query_result.head())

   FirstName     LastName
0       Luís    Gonçalves
1     Leonie       Köhler
2   François     Tremblay
3      Bjørn       Hansen
4  František  Wichterlová

<br>**carregando um csv com pandas**

In [26]:
# existem milhares de parametros mas basicamente ....
import pandas as pd

pd.read_csv('res/sample.csv',delimiter=";")

   valores1  valores2  valores3
0        10        20        30
1        40        50        60
2         7        80        90

<br>**Carregando excel com pandas (atencao para a dependencia do xlrd)**

In [29]:
pd.read_excel('res/sample_spreadsheet.xls')   #csv('res/sample.csv',delimiter=";")

        Nome  Valor
0       Enzo    100
1      Joao      37
2     Valdir    300
3  Jucicreia      2